OpenFOAM-7/chapter4/multiRegionHeaterFine/constant/regionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      regionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//fluidRegionNames ( air ); //syntax for previous OpenFOAM versions 
//solidRegionNames ( heater surrondingSolid );

regions
(
    fluid       (air)
    solid       (heater surrondingSolid)
);
// ************************************************************************* //
