OpenFOAM-7/chapter4/multiRegionHeaterFine/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Heater
    {
        name    heater;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        { 
            box (-0.008  0.006 -0.020 )(0.008 0.010 0.020);
        }
    }
    {
        name    heater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set heater;           // name of cellSet
        }
    }

    // air
    {
        name    air;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
           p1  (0 0 -0.02); 
           p2  (0 0  0.02);
           radius    0.004;
        }
    }
    {
        name    air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set air;
        }
    }

    // surronding solid is all the other cells
    {
        name    surrondingSolid;
        type    cellZoneSet;
        action  clear;
    }
    {
        name    surrondingSolid;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set heater;
        }
    }
    {
        name    surrondingSolid;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set air;
        }
    }

    {
        name    surrondingSolid;
        type    cellSet;
        action  invert;
    }
    {
        name    surrondingSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set surrondingSolid;
        }
    }
);

// ************************************************************************* //
